src/Documents/ИС_Ozon_ФормированиеПоставкиFBO.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_Ozon_ФормированиеПоставкиFBO</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоНоменклатуры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаркированныйТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИС_Ozon_СоответствиеХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ozon_СоответствиеХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураOzon</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры25.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры25</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаЦО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОтКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратТоваровОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПередачаТоваровХранителю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПередачаТоваровХранителю</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/ВариантыКомплектацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыКомплектацииНоменклатуры</Name>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоменклатураОсновногоКомпонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаОсновногоКомпонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантРасчетаЦеныНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаЦенНаборов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ИС_Ozon_ФормированиеПоставкиFBO/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
//+ ИнфоСофт Заварин К.В. 14.06.24 УА #72552
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СортировкаЭтикеток = "Наименование";
КонецПроцедуры //- ИнфоСофт Заварин К.В. 14.06.24 УА #72552

#КонецОбласти
#Область ОбработчикиКомандФорм              

//+ ИнфоСофт Стояк Ю.К. 25.01.2024 УА #62645
&НаКлиенте
Процедура СформироватьФайлЭксель(Команда)
	
	Массив = Элементы.Список.ВыделенныеСтроки;
	
	Табличныйдокумент = СформироватьТабличныйДокументПервыйЭтап(Массив); 
	
	Табличныйдокумент.Показать();
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.01.2024 УА #62645

//+ ИнфоСофт Стояк Ю.К. 25.01.2024 УА #62645
&НаКлиенте
Процедура ПечатьШтрихкодов(Команда)  
	
	Массив = Элементы.Список.ВыделенныеСтроки;
	
	Табличныйдокумент = СформироватьТабличныйДокументЭтикетки(Массив); 
	
	Табличныйдокумент.Показать();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.01.2024 УА #62645

//+ ИнфоСофт Стояк Ю.К. 14.11.2024 УА #70275
&НаКлиенте
Процедура СоздатьДокументОтгрузки(Команда)
	
	Если НЕ ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран файл.", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран файл.", , , "ПутьКФайлу");
		Возврат;
	КонецЕсли; 
	
	ОшибкаСопоставления = Ложь;
	
	Если Не Элементы.НоменклатураКСозданию.Видимость Тогда
		ЗаполнитьТаблицуДаннымиДокумента();
	КонецЕсли;
	
	Для Каждого Строка Из НоменклатураКСозданию Цикл
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			ОшибкаСопоставления = Истина;			
		КонецЕсли;
	КонецЦикла;
	
	Если ОшибкаСопоставления Тогда
		Элементы.НоменклатураКСозданию.Видимость = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Проверьте сопоставление для создания документов!");
		Возврат;
	КонецЕсли;
	
	Комиссия25 = ИспользуетсяСхемаКомиссии25();
	
	Если Комиссия25 Тогда
		ФормаНовогоДокумента = ПолучитьФорму("Документ.ПередачаТоваровХранителю.Форма.ФормаДокумента");	
	Иначе	
		ФормаНовогоДокумента = ПолучитьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента");
	КонецЕсли; 
	
	ДанныеФормы = ФормаНовогоДокумента.Объект;
	
	ЗаполнитьДанныеНаСервере(ДанныеФормы, Комиссия25);
	
	КопироватьДанныеФормы(ДанныеФормы, ФормаНовогоДокумента.Объект);

    ФормаНовогоДокумента.Модифицированность = Истина;
	
    ФормаНовогоДокумента.Открыть();
			
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.11.2024 УА #70275

//+ ИнфоСофт Стояк Ю.К. 14.11.2024 УА #70275
&НаКлиенте
Процедура ВыполнитьПроверкуАкта(Команда)  
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран файл.", , , "Профиль");
		Возврат;
	КонецЕсли;       	
	
	Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран файл.", , , "ПутьКФайлу");
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДокументПередачиТоваровНаКомиссиию) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран документ передачи товаров на комиссию.", , , "ДокументПередачиТоваровНаКомиссиию");
		Возврат;
	КонецЕсли;
	
	УстановитьНачальноеОформление();
		
	ВыполнитьПроверкуАктаНаСервере(); 
	
КонецПроцедуры//- ИнфоСофт Стояк Ю.К. 14.11.2024 УА #70275 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

//+ ИнфоСофт Стояк Ю.К. 14.11.2024 УА #70275
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	ОчиститьСообщения();  
		
	Элементы.НоменклатураКСозданию.Видимость = Ложь;
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл отчета комиссионера";
	ДиалогВыбораФайла.МножественныйВыбор =  Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.Фильтр = "Excel файлы(*.xls;*.xlsx)|*.xls;*.xlsx";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Реквизит", "ПутьКФайлу");
	ДополнительныеПараметры.Вставить("Адрес", "АдресОтчетаВоВременномХранилище");  
	ДополнительныеПараметры.Вставить("ДиалогВыбораФайла", ДиалогВыбораФайла);
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры));

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.11.2024 УА #70275 

//+ ИнфоСофт Стояк Ю.К. 14.11.2024 УА #70275
&НаСервере
Процедура ЗаполнитьТаблицуДаннымиДокумента()
	
	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);  
	
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	ТабличныйДокумент.Прочитать(Имя);
	
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	
	ДанныеАкта = Новый ТаблицаЗначений;
	ДанныеАкта.Колонки.Добавить("Баркод", Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(50)));
	ДанныеАкта.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(50)));
	ДанныеАкта.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	ДанныеАкта.Колонки.Добавить("КоличествоЗаявлено", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	
	Для сч = 4 По КоличествоСтрок Цикл 	
		Попытка
			Баркод  = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 2).ТекущаяОбласть.Текст);
			Артикул = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 3).ТекущаяОбласть.Текст);
			
			Если Баркод = "" И Артикул = "" Тогда
				Прервать;
			КонецЕсли;
			
			КоличествоЗаявлено  = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 5).ТекущаяОбласть.Текст);
			Количество  = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 6).ТекущаяОбласть.Текст);			
			
			НоваяСтрока 					= ДанныеАкта.Добавить();
			НоваяСтрока.Баркод 				= Баркод;    
			НоваяСтрока.Артикул 			= Артикул;
			НоваяСтрока.Количество 			= Количество;
			НоваяСтрока.КоличествоЗаявлено 	= КоличествоЗаявлено;
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось загрузить строку " + Строка(сч)); 	
		КонецПопытки;
	КонецЦикла;
	
	Попытка
		УдалитьФайлы(Имя);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
	КонецПопытки;
	
	Если ДанныеАкта.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Выбран некорректный файл. Выберите акт приемкм товаров.");
		Возврат;
	КонецЕсли;
	
	НоменклатураКСозданию.Загрузить(ПолучитьСоответствияНоменклатуры(ДанныеАкта));	
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.11.2024 УА #70275

//+ ИнфоСофт Стояк Ю.К. 14.11.2024 УА #70275
&НаСервере
Процедура ЗаполнитьДанныеНаСервере(ДанныеФормы, Комиссия25)
		
	УстановитьПривилегированныйРежим(Истина);
	
	ФукнциональныеОпции = ИС_Ozon_Сервер.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	Организация = ФукнциональныеОпции.Организация; 
	Партнер = ФукнциональныеОпции.ПартнерOzon; 
	Соглашение = ФукнциональныеОпции.СоглашениеOzon;
	Контрагент = ФукнциональныеОпции.КонтрагентOzon;
	Договор = ФукнциональныеОпции.ДоговорOzon;
	
	Если Не ЗначениеЗаполнено(Партнер) Тогда
		ТекстСообщения = СтрШаблон(
			"Не заполнен контрагент в настройках профиля для аккаунта: %1. Документ отчет комиссионера не создан.",
			Профиль);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");

		Если ЗначениеЗаполнено(Договор) Тогда
			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(Договор, "ХозяйственнаяОперация") = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию") Тогда
				ТекстСообщения = СтрШаблон(
					"В выбранный договор контрагента в настройках профиля для аккаунта: %1 имеет хозяйственную операцию отличающуюся от ""Передача на комиссию"". Документ отчет комиссионера не создан.",
					Профиль);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли;
				ХозОперация = Договор.ХозяйственнаяОперация;
		Иначе
			ТекстСообщения = СтрШаблон(
				"Не заполнен договор контрагента в настройках для аккаунта: %1. Документ отчет комиссионера не создан.",
				Профиль);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;

	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	Если ИспользоватьСоглашенияСКлиентами Тогда
		Если ЗначениеЗаполнено(Соглашение) Тогда
			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(Соглашение, "ХозяйственнаяОперация") = ХозОперация Тогда
				ТекстСообщения = СтрШаблон(
					"В выбранное соглашение с клиентом в настройках профиля для аккаунта: %1 имеет хозяйственную операцию отличающуюся от ""Передача на комиссию"". Документ отчет комиссионера не создан.",
					Профиль);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли; 
			ХозОперация = Соглашение.ХозяйственнаяОперация;
		Иначе
			ТекстСообщения = СтрШаблон(
				"Не заполнено соглашение с клиентом в настройках профиля для аккаунта: %1. Документ отчет комиссионера не создан.",
				Профиль);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	КонецЕсли;  
	
	Если Комиссия25 Тогда
		НовыйДокумент = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.ПередачаТоваровХранителю"));	
	Иначе	
		НовыйДокумент = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.РеализацияТоваровУслуг"));	
	КонецЕсли;
	
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", Организация);
	ДанныеЗаполнения.Вставить("Партнер", Партнер);
	ДанныеЗаполнения.Вставить("Контрагент", Контрагент);
	ДанныеЗаполнения.Вставить("Договор", Договор);
	ДанныеЗаполнения.Вставить("Соглашение", Соглашение);
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСоглашению", Истина);

	НовыйДокумент.Заполнить(ДанныеЗаполнения);
	
	НовыйДокумент.Партнер 				= Партнер;
	НовыйДокумент.Контрагент 			= Контрагент;
	НовыйДокумент.Договор 	 			= Договор;
	НовыйДокумент.Соглашение 			= Соглашение; 

	Если Не Комиссия25 Тогда
		НовыйДокумент.ХозяйственнаяОперация = ХозОперация;
	Иначе
		НовыйДокумент.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию;		
	КонецЕсли;  
	
	ТаблицаТранзакций = ПолучитьСписокТоваров();
	
	ЗаполнитьТЧДокумента(НовыйДокумент, ТаблицаТранзакций);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц"); 
	
	Если Не Комиссия25 Тогда
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата",
			НовыйДокумент.Организация, НовыйДокумент.НалогообложениеНДС, НовыйДокумент.Дата));
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
			ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент));
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС",
			НовыйДокумент.ЦенаВключаетНДС));
	КонецЕсли;
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(НовыйДокумент.Товары, СтруктураДействий, Неопределено);
	
	ЗначениеВДанныеФормы(НовыйДокумент, ДанныеФормы);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 14.11.2024 УА #70275

//+ ИнфоСофт Стояк Ю.К. 25.01.2024 УА #62645
&НаСервере
Функция СформироватьТабличныйДокументПервыйЭтап(Массив) 
	
	ТаблицаВыгрузки = Новый ТаблицаЗначений;
	
	ТаблицаВыгрузки.Колонки.Добавить("артикул", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	ТаблицаВыгрузки.Колонки.Добавить("имя_необязательно_", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)), "имя (необязательно)"); 
	ТаблицаВыгрузки.Колонки.Добавить("количество", Новый ОписаниеТипов("число"));
		
	КоличествоНоменклатуры = 0;
	
	Для Каждого Документ Из Массив Цикл
		КоличествоНоменклатуры = КоличествоНоменклатуры + Документ.ИтогоНоменклатуры;
		Для Каждого Строка Из Документ.Товары Цикл
			СтрокаТЗ = ТаблицаВыгрузки.Добавить();
			СтрокаТЗ.артикул = Строка.Артикул;
			СтрокаТЗ.имя_необязательно_ = "";					
			СтрокаТЗ.количество = Строка.Количество;
		КонецЦикла;
	КонецЦикла;	                                     
	
	ТаблицаВыгрузки.Свернуть("артикул, имя_необязательно_", "количество");
		
	ТабДок = СформироватьТабличныйДокумент(ТаблицаВыгрузки);
	
	Возврат ТабДок
		
КонецФункции //- ИнфоСофт Стояк Ю.К. 25.01.2024 УА #62645

//+ ИнфоСофт Стояк Ю.К. 25.01.2024 УА #62645
&НаСервере
Функция СформироватьТабличныйДокумент(ТаблицаВыгрузки) 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаВыгрузки); 
	Построитель.ВыводитьЗаголовокОтчета = Ложь;
	Построитель.Вывести(ТабличныйДокумент);

	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.УдалитьОбласть(ТабличныйДокумент.Область("R1C1:R" + Строка(КоличествоНоменклатуры + 2) + "C1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	ТабличныйДокумент.Область("R1C2:R1C2").Текст = "имя (необязательно)"; 
	ТабличныйДокумент.Область("R1C1:R" + Строка(КоличествоНоменклатуры + 1) + "C1").ШиринаКолонки = 20;
	ТабличныйДокумент.Область("R1C2:R" + Строка(КоличествоНоменклатуры + 1) + "C2").ШиринаКолонки = 20;
	ТабличныйДокумент.Область("R1C3:R" + Строка(КоличествоНоменклатуры + 1) + "C3").ШиринаКолонки = 20;
	
	Возврат ТабличныйДокумент;  
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 25.01.2024 УА #62645

//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
&НаСервере
Функция СформироватьТабличныйДокументЭтикетки(МассивОбъектов)  
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати = "Этикетка";		
	
	Если ТипШтрихкода = 0 Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_Ozon_ФормированиеПоставкиFBO.ПФ_MXL_Штрихкод58х40_Ozon");
	ИначеЕсли ТипШтрихкода = 1 Тогда 
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_Ozon_ФормированиеПоставкиFBO.ПФ_MXL_Штрихкод43х25_Ozon");
	ИначеЕсли ТипШтрихкода = 2 Тогда 
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_Ozon_ФормированиеПоставкиFBO.ПФ_MXL_Штрихкод30х20_Ozon");
	КонецЕсли;
	
	ОбластьМакетаОсновныеДанные = Макет.ПолучитьОбласть("Этикетка");      
	
	Эталон = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ИС_МП_Эталон"); 
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		
		ДанныеДок = ПолучитьДанныеДляФормированияЭтикетки(ЭлементМассива.Ссылка); 
		//+ ИнфоСофт Заварин К.В. 13.06.24 УА #72552
		ДанныеДок.Сортировать(СортировкаЭтикеток + " Возв");
		//- ИнфоСофт Заварин К.В. 13.06.24 УА #72552
		Для Каждого Данные Из ДанныеДок Цикл 
			
			Для Итератор = 1 По Данные.Количество Цикл    
				
				ОбластьМакетаОсновныеДанные.Параметры.Заполнить(Данные);
				
				ПараметрыШК = ИС_MP_ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
				
				ПараметрыШК.Ширина = Окр(ОбластьМакетаОсновныеДанные.Рисунки.Штрихкод.Ширина / КоличествоМиллиметровВПикселе);
				ПараметрыШК.Высота = Окр(ОбластьМакетаОсновныеДанные.Рисунки.Штрихкод.Высота / КоличествоМиллиметровВПикселе);
				ПараметрыШК.РазмерШрифта = 10;
				ПараметрыШК.Штрихкод = Данные.Штрихкод;
				ПараметрыШК.Масштабировать = Истина;
				ПараметрыШК.СохранятьПропорции = Истина;
				ПараметрыШК.ВертикальноеВыравнивание = 2;
				
				СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШК);
				
				Если СтруктураКартинки.Результат Тогда	
					ОбластьМакетаОсновныеДанные.Рисунки.Штрихкод.Картинка = СтруктураКартинки.Картинка;
				КонецЕсли;  
				
				ТабличныйДокумент.Вывести(ОбластьМакетаОсновныеДанные);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254

//+ ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254
&НаСервере
Функция ПолучитьДанныеДляФормированияЭтикетки(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Штрихкод КАК Штрихкод,
	|	Штрихкоды.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Штрихкоды
	|ИЗ
	|	&Штрихкоды КАК Штрихкоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Штрихкоды.Количество) КАК Количество,
	|	ИС_Ozon_Штрихкоды.Наименование КАК Штрихкод,
	|	ИС_Ozon_Номенклатура.offer_id КАК Артикул,
	|	ИС_Ozon_Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	ВТ_Штрихкоды КАК ВТ_Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Штрихкоды КАК ИС_Ozon_Штрихкоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
	|			ПО ИС_Ozon_Штрихкоды.Владелец = ИС_Ozon_Номенклатура.Ссылка
	|		ПО ВТ_Штрихкоды.Штрихкод = ИС_Ozon_Штрихкоды.Наименование
	|ГДЕ
	|	ИС_Ozon_Номенклатура.Профиль = &Профиль
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_Ozon_Штрихкоды.Наименование,
	|	ИС_Ozon_Номенклатура.offer_id,
	|	ИС_Ozon_Номенклатура.Наименование";
	
	Запрос.УстановитьПараметр("Штрихкоды", Документ.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Профиль", Документ.Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//РезультатТЗ = Новый ТаблицаЗначений;   
	//
	//РезультатТЗ.Колонки.Добавить("Состав", Новый ОписаниеТипов("Строка"));
	//РезультатТЗ.Колонки.Добавить("Бренд", Новый ОписаниеТипов("Строка"));
	//РезультатТЗ.Колонки.Добавить("Предмет", Новый ОписаниеТипов("Строка"));
	//РезультатТЗ.Колонки.Добавить("Цвет", Новый ОписаниеТипов("Строка"));
	//РезультатТЗ.Колонки.Добавить("Размер", Новый ОписаниеТипов("Строка"));
	//РезультатТЗ.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка"));
	//РезультатТЗ.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка"));
	//РезультатТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
	//	
	//	СтрокаТЗ = РезультатТЗ.Добавить();
	//	СтрокаТЗ.Количество = ВыборкаДетальныеЗаписи.Количество; 
	//	СтрокаТЗ.Штрихкод = ВыборкаДетальныеЗаписи.Штрихкод;
	//	СтрокаТЗ.Артикул = ВыборкаДетальныеЗаписи.Размер.Владелец.VendorCode; 
	//	СтрокаТЗ.Предмет = ВыборкаДетальныеЗаписи.Размер.Владелец.object;
	//	СтрокаТЗ.Размер = ВыборкаДетальныеЗаписи.Размер.techSize;
	//	СтрокаТЗ.Состав = ПолучитьЗначенияПолейНоменклатурыВБ(ВыборкаДетальныеЗаписи.Размер.Владелец, "Состав"); 
	//	СтрокаТЗ.Бренд = ПолучитьЗначенияПолейНоменклатурыВБ(ВыборкаДетальныеЗаписи.Размер.Владелец, "Бренд");
	//    СтрокаТЗ.Цвет = ПолучитьЗначенияПолейНоменклатурыВБ(ВыборкаДетальныеЗаписи.Размер.Владелец, "Цвет");  
	//	
	//КонецЦикла;  
	//
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.08.2023 УА #62254	

//+ ИнфоСофт Стояк Ю.К. 16.11.2024 УА #70275
&НаСервере
Функция ИспользуетсяСхемаКомиссии25()  
	
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами"); 
	
	ФукнциональныеОпции = ИС_Ozon_Сервер.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	Соглашение = ФукнциональныеОпции.СоглашениеOzon;
	Договор = ФукнциональныеОпции.ДоговорOzon;
	
	
	Если ИспользоватьДоговорыСКлиентами Тогда
		Если Не ЗначениеЗаполнено(Договор) Тогда
			Возврат Ложь;
		Иначе
			Возврат Договор.КомиссионныеПродажи25;	
		КонецЕсли;
	Иначе
		Если Не ЗначениеЗаполнено(Соглашение) Тогда
			Возврат Ложь;
		Иначе
			Возврат Соглашение.КомиссионныеПродажи25;	
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 16.11.2024 УА #70275

#КонецОбласти  

#Область ПроверкаАктаПриемки

//+ ИнфоСофт Стояк Ю.К. 07.11.2024 УА #70275
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныеФайлы = ДиалогВыбораФайла.ВыбранныеФайлы;
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ЭтотОбъект[ДополнительныеПараметры.Реквизит] = ВыбранныеФайлы[0];
		
		ВыбранныйФайл = Новый Файл(ВыбранныеФайлы[0]);
		ПутьКФайлуВоВременномКаталоге = ВыбранныеФайлы[0];
		ПоместитьФайлНаСервер(ДополнительныеПараметры.Адрес);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 07.11.2024 УА #70275  

//+ ИнфоСофт Стояк Ю.К. 07.11.2024 УА #70275
&НаКлиенте
Процедура ПоместитьФайлНаСервер(Адрес)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоместитьФайлНаСерверЗавершение", ЭтотОбъект, Новый Структура("Адрес", Адрес));
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения, , , , ПутьКФайлуВоВременномКаталоге, УникальныйИдентификатор);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 07.11.2024 УА #70275 

//+ ИнфоСофт Стояк Ю.К. 07.11.2024 УА #70275
&НаКлиенте
Процедура ПоместитьФайлНаСерверЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.ПомещениеФайлаОтменено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось поместить файл на сервер, попробуйте ещё раз...", , , "ПутьКФайлу");
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[Параметры.Адрес] = Результат.Адрес;          
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 07.11.2024 УА #70275

//+ ИнфоСофт Стояк Ю.К. 07.11.2024 УА #70275
&НаКлиенте
Процедура УстановитьНачальноеОформление()
	ОчиститьСообщения();
	Избыток.Очистить();
	Недостача.Очистить();
	НеНайденныеАртикулы.Очистить();
	Элементы.ГруппаИзбыток.Скрыть();
	Элементы.ГруппаНедостача.Скрыть();
	Элементы.ГруппаНеНайденныеАртикулы.Скрыть();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 07.11.2024 УА #70275

//+ ИнфоСофт Стояк Ю.К. 07.11.2024 УА #70275
&НаСервере
Процедура ВыполнитьПроверкуАктаНаСервере()

	ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(АдресОтчетаВоВременномХранилище);
	Имя = ПолучитьИмяВременногоФайла("xlsx");
	ФайлВременногоХранилища.Записать(Имя);  
	
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	ТабличныйДокумент.Прочитать(Имя);
	
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	
	ДанныеАкта = Новый ТаблицаЗначений;
	ДанныеАкта.Колонки.Добавить("Баркод", Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(50)));
	ДанныеАкта.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(50)));
	ДанныеАкта.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	ДанныеАкта.Колонки.Добавить("КоличествоЗаявлено", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	
	Для сч = 4 По КоличествоСтрок Цикл 	
		Попытка
			Баркод  = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 2).ТекущаяОбласть.Текст);
			Артикул = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 3).ТекущаяОбласть.Текст);
			
			Если Артикул = "" Тогда
				Прервать;
			КонецЕсли;
			
			КоличествоЗаявлено  = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 5).ТекущаяОбласть.Текст);
			Количество  = Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 6).ТекущаяОбласть.Текст);			
			
			НоваяСтрока 					= ДанныеАкта.Добавить();
			НоваяСтрока.Баркод 				= Баркод;    
			НоваяСтрока.Артикул 			= Артикул;
			НоваяСтрока.Количество 			= Количество;
			НоваяСтрока.КоличествоЗаявлено 	= КоличествоЗаявлено;
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось загрузить строку " + Строка(сч)); 	
		КонецПопытки;
	КонецЦикла;
	
	Попытка
		УдалитьФайлы(Имя);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
	КонецПопытки;
	
	Если ДанныеАкта.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Выбран некорректный файл. Выберите акт приемкм товаров.");
		Возврат;
	КонецЕсли;
	
	ДанныеАктаНоменклатура = ПолучитьСоответствияНоменклатуры(ДанныеАкта);
	
	ВыполнитьПроверкуНаНеизвестныеАртикулы(ДанныеАкта);
	
	ДанныеДокумента = ПолучитьДанныеДокумента();
	
	Если ДанныеДокумента.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Товары не найдены в документе. Проверьте выбранный документ.");
		Возврат;
	КонецЕсли;
	
	ВыполнитьСравнениеДанных(ДанныеАктаНоменклатура, ДанныеДокумента);
	
	Если Избыток.Количество() = 0 И Избыток.Количество() = 0 И НеНайденныеАртикулы.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Расхождений не найдено.");
		Возврат;
	КонецЕсли;
	
	Если Избыток.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Найдены товары отсутствующие в документе передачи.");
		Элементы.ГруппаИзбыток.Показать();
	КонецЕсли;
	
	Если Недостача.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Найдены товары отсутствующие в акте.");
		Элементы.ГруппаНедостача.Показать();
	КонецЕсли;
	
	Если НеНайденныеАртикулы.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Найдены не идентифицированные штрихкоды.");
		Элементы.ГруппаНеНайденныеАртикулы.Показать();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 07.11.2024 УА #70275

//+ ИнфоСофт Стояк Ю.К. 07.11.2024 УА #70275
&НаСервере
Функция ПолучитьСоответствияНоменклатуры(ДанныеАкта) 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДанныеАкта.Баркод КАК Баркод,
	                      |	ДанныеАкта.Артикул КАК Артикул,
	                      |	ДанныеАкта.Количество КАК Количество,
	                      |	ДанныеАкта.КоличествоЗаявлено КАК КоличествоЗаявлено
	                      |ПОМЕСТИТЬ ВТ_ДанныеАкта
	                      |ИЗ
	                      |	&ДанныеАкта КАК ДанныеАкта
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ДанныеАкта.Артикул КАК Артикул,
	                      |	МАКСИМУМ(ИС_Ozon_СоответствиеХарактеристик.Номенклатура) КАК Номенклатура,
	                      |	МАКСИМУМ(ИС_Ozon_СоответствиеХарактеристик.Характеристика) КАК Характеристика,
	                       //+ ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91523
						  |	МАКСИМУМ(ВЫБОР
						  |			КОГДА ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
						  |				ТОГДА ИСТИНА
						  |			ИНАЧЕ ЛОЖЬ
						  |		КОНЕЦ) КАК ЭтоНабор                   
						  //|	МАКСИМУМ(ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ЭтоНабор) КАК ЭтоНабор
						  //- ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91523
	                      |ПОМЕСТИТЬ ВТ_Номенклатура
	                      |ИЗ
	                      |	ВТ_ДанныеАкта КАК ВТ_ДанныеАкта
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	                      |		ПО ВТ_ДанныеАкта.Артикул = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id
	                      |			И (ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль = &Профиль)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_ДанныеАкта.Артикул
	                      |;
	                      |
	                      //+ ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91523						  
						  //|////////////////////////////////////////////////////////////////////////////////
						  //|ВЫБРАТЬ
						  //|	ВТ_Номенклатура.Артикул КАК Артикул,
						  //|	СоставНаборов.Номенклатура КАК Номенклатура,
						  //|	СоставНаборов.Характеристика КАК Характеристика,
						  //|	СоставНаборов.Количество КАК Количество
						  //|ПОМЕСТИТЬ ВТ_Набор
						  //|ИЗ
						  //|	ВТ_Номенклатура КАК ВТ_Номенклатура
						  //|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставНаборов КАК СоставНаборов
						  //|		ПО ВТ_Номенклатура.Номенклатура = СоставНаборов.НоменклатураНабора
						  //|			И ВТ_Номенклатура.Характеристика = СоставНаборов.ХарактеристикаНабора
						  //|;
						  //|
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ
						  |	ВТ_Номенклатура.Артикул КАК Артикул,
						  |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
						  |	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
						  |	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество
						  |ПОМЕСТИТЬ ВТ_Набор
						  |ИЗ
						  |	ВТ_Номенклатура КАК ВТ_Номенклатура
						  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
						  |		ПО ВТ_Номенклатура.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
						  |;
						  |                                           
						  //- ИнфоСофт Стояк Ю.К. 21.01.2025 УА #91523
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЫБОР
	                      |		КОГДА ВТ_Номенклатура.ЭтоНабор = ИСТИНА
	                      |			ТОГДА ВТ_Набор.Номенклатура
	                      |		ИНАЧЕ ЕСТЬNULL(ВТ_Номенклатура.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	                      |	КОНЕЦ КАК Номенклатура,
	                      |	ВЫБОР
	                      |		КОГДА ВТ_Номенклатура.ЭтоНабор = ИСТИНА
	                      |			ТОГДА ВТ_Набор.Характеристика
	                      |		ИНАЧЕ ЕСТЬNULL(ВТ_Номенклатура.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	                      |	КОНЕЦ КАК Характеристика,
	                      |	ВЫБОР
	                      |		КОГДА ВТ_Номенклатура.ЭтоНабор = ИСТИНА
	                      |			ТОГДА ВТ_ДанныеАкта.Количество * ВТ_Набор.Количество
	                      |		ИНАЧЕ ВТ_ДанныеАкта.Количество
	                      |	КОНЕЦ КАК Количество,
	                      |	ВЫБОР
	                      |		КОГДА ВТ_Номенклатура.ЭтоНабор = ИСТИНА
	                      |			ТОГДА ВТ_ДанныеАкта.КоличествоЗаявлено * ВТ_Набор.Количество
	                      |		ИНАЧЕ ВТ_ДанныеАкта.КоличествоЗаявлено
	                      |	КОНЕЦ КАК КоличествоЗаявлено,
	                      |	ВТ_ДанныеАкта.Артикул КАК Артикул
	                      |ПОМЕСТИТЬ ВТ_Результат
	                      |ИЗ
	                      |	ВТ_ДанныеАкта КАК ВТ_ДанныеАкта
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	                      |		ПО ВТ_ДанныеАкта.Артикул = ВТ_Номенклатура.Артикул
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Набор КАК ВТ_Набор
	                      |		ПО ВТ_ДанныеАкта.Артикул = ВТ_Набор.Артикул
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Результат.Номенклатура КАК Номенклатура,
	                      |	ВТ_Результат.Характеристика КАК Характеристика,
	                      |	СУММА(ВТ_Результат.Количество) КАК Количество,
	                      |	СУММА(ВТ_Результат.КоличествоЗаявлено) КАК КоличествоЗаявлено,
	                      |	ВТ_Результат.Артикул КАК Артикул
	                      |ИЗ
	                      |	ВТ_Результат КАК ВТ_Результат
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_Результат.Номенклатура,
	                      |	ВТ_Результат.Характеристика,
	                      |	ВТ_Результат.Артикул");
	
	Запрос.УстановитьПараметр("ДанныеАкта", ДанныеАкта); 
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДанныеНоменклатура = Новый ТаблицаЗначений;
	ДанныеНоменклатура.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(50)));
	ДанныеНоменклатура.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	ДанныеНоменклатура.Колонки.Добавить("КоличествоЗаявлено", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	ДанныеНоменклатура.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДанныеНоменклатура.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	
	Пока Выборка.Следующий() Цикл
			НоваяСтрока 						= ДанныеНоменклатура.Добавить();
			НоваяСтрока.Количество 				= Выборка.Количество;
			НоваяСтрока.КоличествоЗаявлено 		= Выборка.КоличествоЗаявлено;
			НоваяСтрока.Номенклатура 			= Выборка.Номенклатура;
			НоваяСтрока.Характеристика 			= Выборка.Характеристика;
			НоваяСтрока.Артикул		 			= Выборка.Артикул;
	КонецЦикла;	
	
	Возврат ДанныеНоменклатура;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 07.11.2024 УА #70275

//+ ИнфоСофт Стояк Ю.К. 05.09.2023 УА #70275
&НаСервере
Функция ПолучитьДанныеДокумента() 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТоварыТЧ.Номенклатура КАК Номенклатура,
	|	ТоварыТЧ.Характеристика КАК Характеристика,
	|	СУММА(ТоварыТЧ.Количество) КАК Количество
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК ТоварыТЧ
	|ГДЕ
	|	ТоварыТЧ.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыТЧ.Номенклатура,
	|	ТоварыТЧ.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Характеристика"); 
	
	
	Запрос.УстановитьПараметр("Ссылка", ДокументПередачиТоваровНаКомиссиию);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДанныеДокумента = Новый ТаблицаЗначений;	
	ДанныеДокумента.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	ДанныеДокумента.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДанныеДокумента.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока					= ДанныеДокумента.Добавить();
		НоваяСтрока.Количество 		= Выборка.Количество;
		НоваяСтрока.Номенклатура 	= Выборка.Номенклатура;
		НоваяСтрока.Характеристика	= Выборка.Характеристика;
	КонецЦикла;
	
	Возврат ДанныеДокумента;
		
КонецФункции //- ИнфоСофт Стояк Ю.К. 05.09.2023 УА #70275

//+ ИнфоСофт Стояк Ю.К. 05.09.2023 УА #70275
&НаСервере
Процедура ВыполнитьСравнениеДанных(ДанныеАкта, ДанныеДокумента) 

	//Выполним поиск соответсвий данных документа к данным акта 
	ДанныеДокументаОбработка = ДанныеДокумента;	
	
	Для Каждого СтрокаАкта Из ДанныеАкта Цикл
		
		СоответствияНайдены = Ложь;	           
		
		МассивУдаляемыхСтрок = Новый Массив;  
		
		СтруктураПоиска = Новый Структура("Номенклатура, Характеристика", СтрокаАкта.Номенклатура, СтрокаАкта.Характеристика); 
		МассивНайденныхСтрок = ДанныеДокументаОбработка.НайтиСтроки(СтруктураПоиска);  
		
		Для Каждого Строка Из МассивНайденныхСтрок Цикл 
			
			СоответствияНайдены = Истина;
			
			Разница = СтрокаАкта.Количество - Строка.Количество;	
			
			Если Разница > 0 Тогда
				ДобавитьСтрокуИзбыток(СтрокаАкта, Разница);	
			ИначеЕсли Разница < 0 Тогда 
				ДобавитьСтрокуНедостача(СтрокаАкта, Разница);	
			КонецЕсли;  
			
			МассивУдаляемыхСтрок.Добавить(Строка);
			
		КонецЦикла;
		
		Для Каждого Строка Из МассивУдаляемыхСтрок Цикл
			ДанныеДокументаОбработка.Удалить(Строка);
		КонецЦикла;
			
		//Для Каждого СтрокаДокумента Из ДанныеДокументаОбработка Цикл  
		//	
		//	Если СтрокаАкта.Номенклатура = СтрокаДокумента.Номенклатура И СтрокаАкта.Характеристика = СтрокаДокумента.Характеристика Тогда
		//		Разница = СтрокаАкта.Количество - СтрокаДокумента.Количество;	
		//		
		//		Если Разница > 0 Тогда
		//			ДобавитьСтрокуИзбыток(СтрокаАкта, Разница);	
		//		ИначеЕсли Разница < 0 Тогда 
		//			ДобавитьСтрокуНедостача(СтрокаАкта, Разница);	
		//		КонецЕсли;
		//		
		//		
		//		//ДанныеДокументаОбработка.Удалить(СтрокаДокумента); 
		//		
		//		СоответствияНайдены = Истина;
		//		
		//	КонецЕсли;  
		//	
		//КонецЦикла;
		
		
		
		Если Не СоответствияНайдены И ЗначениеЗаполнено(СтрокаАкта.Номенклатура) Тогда
			ДобавитьСтрокуИзбыток(СтрокаАкта, СтрокаАкта.Количество);	
		КонецЕсли;
		
	КонецЦикла;		
	
	//Выполним поиск соответсвий данных акта к данным документа
	ДанныеАктаОбработка = ДанныеАкта; 
	
	Для Каждого СтрокаДокумента Из ДанныеДокумента Цикл
				 	
		СоответствияНайдены = Ложь;	
		
		МассивУдаляемыхСтрок = Новый Массив;  
		
		СтруктураПоиска = Новый Структура("Номенклатура, Характеристика", СтрокаДокумента.Номенклатура, СтрокаДокумента.Характеристика); 
		МассивНайденныхСтрок = ДанныеАктаОбработка.НайтиСтроки(СтруктураПоиска);  
		
		Для Каждого Строка Из МассивНайденныхСтрок Цикл 			
			СоответствияНайдены = Истина;			
			МассивУдаляемыхСтрок.Добавить(Строка);			
		КонецЦикла;
		
		Для Каждого Строка Из МассивУдаляемыхСтрок Цикл
			ДанныеДокументаОбработка.Удалить(Строка);
		КонецЦикла;
		
		Если Не СоответствияНайдены И ЗначениеЗаполнено(СтрокаДокумента.Номенклатура) Тогда
			ДобавитьСтрокуНедостача(СтрокаДокумента, СтрокаДокумента.Количество);	
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 05.09.2023 УА #70275

//+ ИнфоСофт Стояк Ю.К. 05.09.2023 УА #70275
&НаСервере
Процедура ДобавитьСтрокуИзбыток(СтрокаАкта, Количество) 
	
	НоваяСтрока 					= Избыток.Добавить();
	НоваяСтрока.Номенклатура 		= СтрокаАкта.Номенклатура;
	НоваяСтрока.Характеристика 		= СтрокаАкта.Характеристика;
	Если Количество < 0 Тогда
		Количество = -Количество;
	КонецЕсли;	
	НоваяСтрока.Количество 			= Количество;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 05.09.2023 УА #70275 

//+ ИнфоСофт Стояк Ю.К. 05.09.2023 УА #70275
&НаСервере
Процедура ДобавитьСтрокуНедостача(СтрокаАкта, Количество) 
	
	НоваяСтрока 					= Недостача.Добавить();
	НоваяСтрока.Номенклатура 		= СтрокаАкта.Номенклатура;
	НоваяСтрока.Характеристика 		= СтрокаАкта.Характеристика;
	Если Количество < 0 Тогда
		Количество = -Количество;
	КонецЕсли;
	НоваяСтрока.Количество 			= Количество;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 05.09.2023 УА #70275

//+ ИнфоСофт Стояк Ю.К. 05.09.2023 УА #70275
&НаСервере
Процедура ВыполнитьПроверкуНаНеизвестныеАртикулы(ДанныеАкта)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДанныеАкта.Артикул КАК Артикул,
	                      |	ДанныеАкта.КоличествоЗаявлено КАК Количество
	                      |ПОМЕСТИТЬ ВТ_ДанныеАкта
	                      |ИЗ
	                      |	&ДанныеАкта КАК ДанныеАкта
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ДанныеАкта.Артикул КАК Артикул,
	                      |	МАКСИМУМ(ИС_Ozon_СоответствиеХарактеристик.Номенклатура) КАК Номенклатура,
	                      |	МАКСИМУМ(ИС_Ozon_СоответствиеХарактеристик.Характеристика) КАК Характеристика,
	                      |	МАКСИМУМ(ВТ_ДанныеАкта.Количество) КАК Количество
	                      |ИЗ
	                      |	ВТ_ДанныеАкта КАК ВТ_ДанныеАкта
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
	                      |		ПО ВТ_ДанныеАкта.Артикул = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.offer_id
	                      |			И (ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon.Профиль = &Профиль)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_ДанныеАкта.Артикул");
	
	Запрос.УстановитьПараметр("ДанныеАкта", ДанныеАкта); 
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			СтрокаТЗ 			= НеНайденныеАртикулы.Добавить();
			СтрокаТЗ.Артикул 	= Выборка.Артикул;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 05.09.2023 УА #70275

//+ ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163
&НаСервере
Процедура ЗаполнитьТЧДокумента(НовыйДокумент, ТаблицаТранзакций)
	
	НовыйДокумент.Товары.Очистить();
	НовыйДокумент.ВидыЗапасов.Очистить();  
	
	ВидЦены = Профиль.ВидЦены;
	
	Для Каждого Транзакция Из ТаблицаТранзакций Цикл
		
		Если Транзакция.ЭтоНабор Тогда
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Транзакция.Номенклатура,
			"ТипНоменклатуры, ВидНоменклатуры");
			
			ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
			ПараметрыКомплектующих.Номенклатура   		= Транзакция.Номенклатура;
			ПараметрыКомплектующих.НоменклатураНабора   = Транзакция.Номенклатура;
			ПараметрыКомплектующих.ХарактеристикаНабора = Транзакция.Характеристика;				
			ПараметрыКомплектующих.КоличествоУпаковок	= Транзакция.Количество;
			ПараметрыКомплектующих.ТипНоменклатуры 		= РеквизитыНоменклатуры.ТипНоменклатуры;
			ПараметрыКомплектующих.ВидНоменклатуры 		= РеквизитыНоменклатуры.ВидНоменклатуры;
			ПараметрыКомплектующих.ЭтоТовар 			= Истина;
			ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
			
			Склады = Новый Массив;
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Дата", 		НовыйДокумент.Дата);
			ДополнительныеПараметры.Вставить("Валюта", 		НовыйДокумент.Валюта);
			ДополнительныеПараметры.Вставить("Склады", 		Склады);
			ДополнительныеПараметры.Вставить("Соглашение", 	НовыйДокумент.Соглашение);
			ДополнительныеПараметры.Вставить("Цена", 		Транзакция.Цена);
			ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", Транзакция.Цена);	
			ДополнительныеПараметры.Вставить("ВидЦены", ВидЦены); 
			
			//+ ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
			Комплектующие = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);
			//- ИнфоСофт Мурсалимов Д.Р. 20.08.24 УА #81483
			
			Для Каждого стрКомплекта Из Комплектующие Цикл
				НоваяСтрока = НовыйДокумент.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКомплекта);
				НоваяСтрока.КоличествоУпаковок 		= Транзакция.Количество;
				НоваяСтрока.КоличествоУпаковок 		= НоваяСтрока.КоличествоУпаковок;
				НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.Количество + стрКомплекта.Погрешность;
				НоваяСтрока.Склад 					= Склад;
			КонецЦикла;						
		Иначе
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			НоваяСтрока.Номенклатура 			= Транзакция.Номенклатура;
			НоваяСтрока.Характеристика 			= Транзакция.Характеристика;				
			НоваяСтрока.Количество			 	= Транзакция.Количество;
			НоваяСтрока.КоличествоУпаковок 		= Транзакция.Количество;
			НоваяСтрока.Цена 					= Транзакция.Цена;
			НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.Количество;
			НоваяСтрока.ВидЦены 				= ВидЦены;
			НоваяСтрока.Склад 					= Склад;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163

//+ ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163
&НаСервере
Функция ПолучитьСписокТоваров()
	
	Если ПолучитьФункциональнуюОпцию("ИспользуетсяЦенообразование25") Тогда
		Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Количество КАК Количество,
		|	ЕСТЬNULL(ЦеныНоменклатуры25СрезПоследних.Цена, 0) КАК Цена,
		|	ВЫБОР
		|		КОГДА
		|			ВТ_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
		|		ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|		КОНЕЦ КАК ЭтоНабор
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(, ) КАК ЦеныНоменклатуры25СрезПоследних
		|			ПО (ВТ_Товары.Номенклатура = ЦеныНоменклатуры25СрезПоследних.Номенклатура)
		|				И (ЦеныНоменклатуры25СрезПоследних.ВидЦены = &ВидЦены)";
		
	Иначе
		Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Количество КАК Количество,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
		|	ВЫБОР
		|		КОГДА
		|			ВТ_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
		|		ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|		КОНЕЦ КАК ЭтоНабор
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ЦеныНоменклатурыСрезПоследних
		|			ПО (ВТ_Товары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура)
		|				И (ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены)";
	КонецЕсли;	
	
	
	Запрос = Новый Запрос(Текст);
	
	Запрос.УстановитьПараметр("ВидЦены", Профиль.ВидЦены);
	Запрос.УстановитьПараметр("Товары", НоменклатураКСозданию.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 01.12.2023 УА #61163

#КонецОбласти
